# The Series Data Structure

In [1]:
import pandas as pd
pd.Series1?

Object `pd.Series1` not found.

In [3]:
animals=['Tiger','Bear','Lion']
pd.Series(animals)

0    Tiger
1     Bear
2     Lion
dtype: object

In [4]:
number=[1,5,9,3,4,7]
pd.Series(number)

0    1
1    5
2    9
3    3
4    4
5    7
dtype: int64

In [5]:
animals = ['Tiger', 'Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [6]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
import numpy as np
np.nan == None

False

In [8]:
np.nan == np.nan

False

In [11]:
np.isnan(np.nan)

True

In [12]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [13]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [14]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [15]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

# Querying a Series

In [16]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [17]:
s.iloc[3]

'South Korea'

In [18]:
s.loc['Golf']

'Scotland'

In [19]:
s['Golf']

'Scotland'

In [21]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [24]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [25]:
total=0
for item in s:
    total+=item
print(total)

324.0

In [26]:
import numpy as np
total=np.sum(s)
print(total)

324.0

In [27]:
#this creates a big series of random numbers
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    446
1    754
2    565
3    707
4    428
dtype: int32

In [28]:
len(s)

10000

In [29]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

858 µs ± 138 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [30]:
%%timeit -n 100
summary = np.sum(s)

195 µs ± 25.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [31]:
s+=2 #adds two to each item in s using broadcasting
s.head()

0    448
1    756
2    567
3    709
4    430
dtype: int32

In [33]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

# The DataFrame Data Structure

In [34]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [35]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [36]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [37]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [38]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({"product_cat":["saop","saop","saop","saop","toothpaste","toothpaste","toothpaste","cream","cream","cream","cream","cream"],
                    "product_sub_cat":["s1","s2","s3","s2","t1","t1","t2","c1","c2","c2","c2","c1"],
                    "price":[100,200,300,200,100,100,200,100,200,200,200,100]})

x = df.groupby(["product_cat","product_sub_cat"])["price"].sum().reset_index()
y = df.groupby("product_cat")["price"].sum().reset_index()
z = pd.merge(x,y,left_on="product_cat",right_on="product_cat")
z["final_price"] = z["price_x"]/z["price_y"]
z[["product_cat","product_sub_cat","final_price"]]

  product_cat product_sub_cat  final_price
0       cream              c1        0.250
1       cream              c2        0.750
2        saop              s1        0.125
3        saop              s2        0.500
4        saop              s3        0.375
5  toothpaste              t1        0.500
6  toothpaste              t2        0.500

In [7]:
df = pd.DataFrame({"product_cat":["saop","saop","saop","saop","toothpaste","toothpaste","toothpaste","cream","cream","cream","cream","cream"],
                    "product_sub_cat":["s1","s2","s3","s2","t1","t1","t2","c1","c2","c2","c2","c1"],
                    "price":[100,200,300,200,100,100,200,100,200,200,200,100]})
df

   product_cat product_sub_cat  price
0         saop              s1    100
1         saop              s2    200
2         saop              s3    300
3         saop              s2    200
4   toothpaste              t1    100
5   toothpaste              t1    100
6   toothpaste              t2    200
7        cream              c1    100
8        cream              c2    200
9        cream              c2    200
10       cream              c2    200
11       cream              c1    100

In [11]:
x = df.groupby(["product_cat","product_sub_cat"])["price"].sum().reset_index()
x
y = df.groupby("product_cat")["price"].sum().reset_index()
y
z = pd.merge(x,y,left_on="product_cat",right_on="product_cat")
z

  product_cat product_sub_cat  price_x  price_y
0       cream              c1      200      800
1       cream              c2      600      800
2        saop              s1      100      800
3        saop              s2      400      800
4        saop              s3      300      800
5  toothpaste              t1      200      400
6  toothpaste              t2      200      400

In [13]:
z["final_price"] = z["price_x"]/z["price_y"]
z

  product_cat product_sub_cat  price_x  price_y  final_price
0       cream              c1      200      800        0.250
1       cream              c2      600      800        0.750
2        saop              s1      100      800        0.125
3        saop              s2      400      800        0.500
4        saop              s3      300      800        0.375
5  toothpaste              t1      200      400        0.500
6  toothpaste              t2      200      400        0.500

In [14]:
z[["product_cat","product_sub_cat","final_price"]]

  product_cat product_sub_cat  final_price
0       cream              c1        0.250
1       cream              c2        0.750
2        saop              s1        0.125
3        saop              s2        0.500
4        saop              s3        0.375
5  toothpaste              t1        0.500
6  toothpaste              t2        0.500